[
{"title": "How can I find out what tariff I’m on?", "answer": "You should be able to find your tariff name on a recent energy bill or you could contact your energy supplier and they’ll tell you. We would like to know the name of your tariff so we can calculate your savings accurately however, you can still switch by using our household calculator. If you have an energy bill and would like us to take a look for you please contact our team at  hello@switchboo.com and we’ll be happy to help."},
{"title": "How is the service completely free?", "answer": "We keep the service completely free by taking a commission from the companies that we switch you to. Switchboo will always display the cheapest deal that we can find and only work with suppliers that provide quality customer service."},
{"title": "Will my energy supply ever get cut off?", "answer": "There is no reason for this to happen. Everything happens behind the scenes, so if you’ve switched to a cheaper supplier through us, the only difference you should notice is your energy bills going down."},
{"title": "What’s the point in switching energy supplier?", "answer": "You should switch energy suppliers because It's the best way to reduce your energy bills. Most suppliers offer 12 month fixed rate contracts and when they end, they move you to a higher standard variable tariff. This is the most expensive way to pay. Switching every year ensures you never move onto an expensive tariff and overpay on your energy bills."},
{"title": "Do I need to contact my old supplier?", "answer": "You don’t have to contact your old supplier. When your switch application is submitted, they are notified by your new supplier automatically and will begin creating your final bill. You should receive the final bill within six weeks of your switch date. Any credit you have built up will be refunded in this final bill and your direct debit will be cancelled. All you need to do is give your new supplier a meter reading when they request it."},
{"title": "How long does it take to switch energy supplier?", "answer": "A switch approximately takes three weeks to complete from when we submit your application to the supplier. In that three week period, you’ll receive an email from your new supplier with information regarding your switch date. Each time you or we switch, you will have a 14 day cooling off period just in case you change your mind and wish to cancel. Your cooling off period starts from the date your switch is processed by Switchboo."},
{"title": "How do I find my energy usage?", "answer": "You can find out your energy usage on a recent bill. It is measured in kilowatt hours (kWh). For the most accurate comparison, take the usage from your bill and enter it into the kWh box. If you don’t have a bill to hand, tell us how much you spend per month or if you don’t know that either, we’ve provided an estimator based on questions such as how many bedrooms you have."},
{"title": "What happens if my energy supplier goes out of business?", "answer": "If a supplier does go out of business, you're protected by Ofgem who will find a new energy supplier to take care of your energy supply. Don’t worry, you won't go without energy to your home as Ofgem guarantees your supply. If your new supplier puts you on an uncompetitive tariff, Switchboo will automatically switch you to a cheaper deal as soon as possible."},
{"title": "How do you use my personal data?", "answer": "We only ask you for specific data needed by your new supplier, so that they can process your energy switch application. We will process your personal data to support your switch application by sending it securely to your new supplier. If you do have any concerns, we strongly recommend that you read our Privacy Policy on our website. It contains important information regarding what personal data we collect, the purposes for processing it and other information required under applicable Data Protection legislation."},
{"title": "How will I know which energy supplier you switch me too?", "answer": "We will always notify you by email each time we re-switch you to a new energy supplier. You are always in full control and have 14 days to cancel if you change your mind. "},
{"title": "I’m on a fixed tariff, when can I switch?", "answer": "You can switch from a fixed tariff at any point, but many carry an exit fee if you leave early. Your savings will determine whether you’d be better off switching now or waiting until your tariff end date. You are entitled to request a switch up to 42 days before your tariff end date, so you don’t have to wait until the end date to switch."},
{"title": "What is an Economy 7 meter?", "answer": "Economy 7 is an energy plan that can help you pay less for your electricity. Basically, you pay normal prices during the day, but cheaper rates for 7 hours during the night. The discount hours are usually 12am–7am during winter and 1am–8am in summer. This can vary slightly by region and supplier, so we’d always advise you to check with your supplier. To find out if you’re already registered for Economy 7, have a look at your electricity or dual fuel bill. If your electricity seems to be charged at two different rates, one for day and one for night, you’re on Economy 7."},
{"title": "Can I switch if I have a smart meter?", "answer": "Yes, you can switch even if you have a smart meter. Most smart meters in the UK are first generation smart meters which will continue to work if you change supplier. First generation smart meters lose their ability to send automatic meter reads to the new supplier and only work with the supplier who installed them. This means you will have to manually provide your new supplier with meter readings, usually once a month."},
{"title": "What should I do if I’m moving house?", "answer": "You need to let your current supplier know at least 48 hours before your move. Ask them to send your final bill to your new address and read the meters on your last day in the house. You must also inform our team at hello@switchboo.com so we can ensure that no recurring switches are made in the future. After that, when you have settled into your new home, come back to us and we’ll make sure that you’re on a great energy deal forever."},
{"title": "What is automatic energy switching?", "answer": "Automatic switching is the easiest way to switch energy suppliers and reduce your bills every year. It’s the upgraded way to switch without the hassle of using comparison websites. The switch process is managed for you and our system finds the best energy deals and switches you to them automatically. Switchboo keeps you away from expensive energy tariffs and makes sure that you’re on a great energy deal forever."},
{"title": "What is a standard variable tariff?", "answer": "A standard variable tariff is a supply contract with an indefinite length that does not have a fixed term. Standard variable tariffs are typically the most expensive plans offered by any energy supplier and are most commonly used by people whose fixed rate deal has run out, or by people who have recently moved to a new property."},
{"title": "How many times will you switch me?", "answer": "We will switch you at the end of your fixed contract, which is normally every 12 months. If you are on a variable tariff we’ll check the prices monthly. We’ll only re-switch you if we can save you at least £50 for gas and electricity switches, £25 for electricity only, and £15 if you have a prepayment meter."},
{"title": "How do I contact Switchboo?", "answer": "You can contact our team at hello@switchboo.com or connect with us through our social media platforms. We’re open Monday to Friday between 9:00am and 5:00pm."},
{"title": "How do I cancel my energy switch?", "answer": "You will have a 14 day cooling off period each time you switch just in case you change your mind and wish to cancel. This period begins as soon as a switch has been processed by you or us. Please note that if you cancel outside of this period you may occur early exit fees from the supplier. You can cancel your energy switch at any point by contacting our customer service team at hello@switchboo.com and quoting your switch reference number starting with the letter ‘E’. "},
{"title": "How do I find my meter serial number??", "answer": "A meter serial number is a unique string of numbers, or numbers and letters, used to identify a gas or electric meter. It’s also known as ‘MSN’ for short. Your meter serial number is usually found on the front of the meter, next to a barcode or on your energy statement, listed as ‘meter number’. Some older meters don’t have barcodes, you may find the serial number embossed on the meter (for electricity meters) or printed in red (for glass meters). If you can’t find your meter serial number, send a photo of your meter to help@switchboo.com and we’ll help you."}
]